wisteria-1c/Конфигурация/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/КлассификаторТНВЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторТНВЭД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВвознаяПошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СырьевойТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonModules/УчетНДСВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// См. Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.БлижайшийНалоговыйПериод.
Функция БлижайшийНалоговыйПериодСервер(Организация, Период) Экспорт
	
	Возврат УчетНДСПереопределяемый.БлижайшийНалоговыйПериод(
		Организация,
		Период);
	
КонецФункции

Функция ПолучитьИдентификаторМакетаРасшифровкиДекларацииПоНДС(Знач ПараметрыОтчета, Знач Показатель, ПользовательскиеНастройки) Экспорт
	
	ИдентификаторМакета = "";
	
	ТаблицаРасшифровок = ПолучитьИзВременногоХранилища(ПараметрыОтчета.АдресВременногоХранилищаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровок) = Тип("ТаблицаЗначений") Тогда
		
		НомерТекущейСтраницы = 0;
		
		ПараметрыОтчета.Свойство("НомерТекущейСтраницы", НомерТекущейСтраницы);
		
		Если НомерТекущейСтраницы = Неопределено ИЛИ НомерТекущейСтраницы = 0 Тогда
			ИмяПоказателя = Показатель;
		Иначе
			ИмяПоказателя = Показатель + "_" + НомерТекущейСтраницы;
		КонецЕсли;
		
		Расшифровка = ТаблицаРасшифровок.Найти(ИмяПоказателя,"ИмяПоказателя");
		
		Если Расшифровка <> Неопределено Тогда
			
			ДополнительныеПараметры = Расшифровка.ДополнительныеПараметры;
			
			ИдентификаторМакета = ДополнительныеПараметры.ИдентификаторМакета;
			
			Если ИдентификаторМакета = "ОткрытьОбъект" Тогда
				
				ДополнительныеПараметры.Свойство("Объект", ИдентификаторМакета);
				
			Иначе
				
				ДополнительныеПараметры.Свойство("ПользовательскиеНастройки", ПользовательскиеНастройки);
				
			КонецЕсли; 
			
			Если Расшифровка.ИмяРаздела = "Раздел5" 
				И НЕ (СтрНачинаетсяС(ИмяПоказателя,"П000500008003") ИЛИ СтрНачинаетсяС(ИмяПоказателя,"П000500009003")) Тогда
				
				ИдентификаторМакетаСтруктура = Новый Структура;
				
				ИдентификаторМакетаСтруктура.Вставить("НачалоПериодаРаздел5", ДополнительныеПараметры.ДатаНачала);
				ИдентификаторМакетаСтруктура.Вставить("КонецПериодаРаздел5", КонецКвартала(ДополнительныеПараметры.ДатаНачала));
				ИдентификаторМакетаСтруктура.Вставить("ИдентификаторМакета", ИдентификаторМакета);
				
				ИдентификаторМакета = ИдентификаторМакетаСтруктура;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	Возврат ИдентификаторМакета;
	
КонецФункции  

// Функция разбиения табличной части (табличный частей) на несколько документов
//
// Параметры:
//   ПараметрыПереносаСтрокТЧ - Структура - структура входных параметров с ключами:
//     * ТабличныеЧасти          - Соответствие - соотствие между проверяемой табличной частью и подчиненной.
//               * Ключ             - Строка - имя проверяемой табличной части
//               * Значение         - Структура - структура с ключами:
//....................* КоличествоСтрокДляПереноса - Число - обязательный ключ в него записывается вычисляемое в функции
//..........................................................количество строк для переноса проверяемой табличной части
//                    * ПодчиненныеТабличныеЧасти - Массив - необязательный ключ массив подчинённых табличных частей,
//                                                           строки из которых нужно перенести в новый документ.
//                    * ПодчиненнаяТЧМаксимальноеКоличествоСтрок - Строка - имя подчиненной табличной части с
//                                                                          максимальным количеством строк.
//                    * МаксимальноеКоличествоСтрокВДокументе    - Число - максимальное количество строк основной
//                                                                         табличной части в новом документе.
//     * РеквизитыДокумента      - Строка - список реквизитов для копирования из документа.
//     * РежимЗаписи             - РежимЗаписиДокумента - режим записи документа.
//     * МаксимальноеКоличествоСтрок - Число - максимальное количество строк, хранимое платформой в табличной части.
//     * Объект                      - ДанныеФормыСтруктура - объект клиентской формы документа, для которого нужно
//                                                            перености строк табличных частей в новые документы.
// Возвращаемое значение:
//  - Булево - Истина в случае успешного переноса строк в новые документы.
//  В случае не удачной транзакции по переносу документов в другой доукмент к структуре ПараметрыПереносаСтрокТЧ
//  добавляется поле ИнформацияОбОшибке - Строка - содержит подробное описание ошибки.
Функция ПеренестиСтрокиТабличныхЧастейВДругойДокументНаСервере(ПараметрыПереносаСтрокТЧ) Экспорт
	
	Объект = ПараметрыПереносаСтрокТЧ.Объект;
	ОбъектМетоданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
	Если ОбъектМетоданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	МаксимальноеКоличествоСтрок = ПараметрыПереносаСтрокТЧ.МаксимальноеКоличествоСтрок;
	РежимЗаписи = ПараметрыПереносаСтрокТЧ.РежимЗаписи;
	ТабличныеЧасти = ПараметрыПереносаСтрокТЧ.ТабличныеЧасти;
	РеквизитыДокумента = ПараметрыПереносаСтрокТЧ.РеквизитыДокумента;
	
	НачатьТранзакцию();
	
	Попытка
	
		Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
			
			КоличествоСтрокДляПереноса = ТабличнаяЧасть.Значение.КоличествоСтрокДляПереноса;
			Если КоличествоСтрокДляПереноса = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИндексПоследнийСтроки = Объект[ТабличнаяЧасть.Ключ].Количество()-1;
			
			ПодчиненныеТабличныеЧасти = Новый Массив;
			Если ТабличнаяЧасть.Значение.Свойство("ПодчиненныеТабличныеЧасти") Тогда
				ПодчиненныеТабличныеЧасти = ТабличнаяЧасть.Значение.ПодчиненныеТабличныеЧасти;
			КонецЕсли;
			
			ПодчиненнаяТЧМаксимальноеКоличествоСтрок = "";
			Если ТабличнаяЧасть.Значение.Свойство("ПодчиненнаяТЧМаксимальноеКоличествоСтрок") Тогда
				ПодчиненнаяТЧМаксимальноеКоличествоСтрок = ТабличнаяЧасть.Значение.ПодчиненнаяТЧМаксимальноеКоличествоСтрок;
			КонецЕсли;
			
			МаксимальноеКоличествоСтрокВДокументе = 0;
			Если ТабличнаяЧасть.Значение.Свойство("МаксимальноеКоличествоСтрокВДокументе") Тогда
				МаксимальноеКоличествоСтрокВДокументе = ТабличнаяЧасть.Значение.МаксимальноеКоличествоСтрокВДокументе;
			КонецЕсли;
			
			ИндексСтроки = 0;
			КоличествоСтрокТЧ = 0;
			
			СтрокиДляУдаленияТЧ = Новый Массив;
			
			СоответвиеПодчиненныхТЧДляУдаления = Новый Соответствие;
			Для каждого ПодчиненнаяТабличнаяЧасть Из ПодчиненныеТабличныеЧасти Цикл
				СоответвиеПодчиненныхТЧДляУдаления.Вставить(ПодчиненнаяТабличнаяЧасть, Новый Массив);
			КонецЦикла;
			
			Пока ИндексСтроки < КоличествоСтрокДляПереноса Цикл
				
				Если КоличествоСтрокТЧ = 0 Тогда
					НовыйДокументОбъект = Документы[ОбъектМетоданных.Имя].СоздатьДокумент();
					ЗаполнитьЗначенияСвойств(НовыйДокументОбъект, Объект , РеквизитыДокумента);
				КонецЕсли;
				
				СтрокаТЧНовогоДокумента = НовыйДокументОбъект[ТабличнаяЧасть.Ключ].Добавить();
				СтрокаТЧТекущегоДокумента = Объект[ТабличнаяЧасть.Ключ][ИндексПоследнийСтроки - ИндексСтроки];
				СтрокиДляУдаленияТЧ.Добавить(СтрокаТЧТекущегоДокумента);
				ЗаполнитьЗначенияСвойств(СтрокаТЧНовогоДокумента, СтрокаТЧТекущегоДокумента);
				
				Для Каждого ПодчиненнаяТЧ Из ПодчиненныеТабличныеЧасти Цикл
					КлючПоиска = Новый Структура("КлючСтроки", СтрокаТЧТекущегоДокумента.КлючСтроки);
					МассивСтрок = Объект[ПодчиненнаяТЧ].НайтиСтроки(КлючПоиска);
					
					Для Каждого СтрокаТЧ Из МассивСтрок Цикл
						СтрокаПодчиненнойТЧНовогоДокумента = НовыйДокументОбъект[ПодчиненнаяТЧ].Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаПодчиненнойТЧНовогоДокумента, СтрокаТЧ);
						СоответвиеПодчиненныхТЧДляУдаления[ПодчиненнаяТЧ].Добавить(СтрокаТЧ);
					КонецЦикла;
					
				КонецЦикла;
				
				КоличествоСтрокТЧ = КоличествоСтрокТЧ + 1;
				
				ИндексСтроки = ИндексСтроки + 1; 
				
				НовыйДокументКоличествоСтрок = НовыйДокументОбъект[ТабличнаяЧасть.Ключ].Количество();
				
				Если КоличествоСтрокТЧ = МаксимальноеКоличествоСтрок
					ИЛИ ИндексСтроки = КоличествоСтрокДляПереноса
					ИЛИ (ЗначениеЗаполнено(ПодчиненнаяТЧМаксимальноеКоличествоСтрок)
						И НовыйДокументКоличествоСтрок = МаксимальноеКоличествоСтрокВДокументе)Тогда
					НовыйДокументОбъект.Записать(РежимЗаписи);
					КоличествоСтрокТЧ = 0;
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаТЧ Из СтрокиДляУдаленияТЧ Цикл
				Объект[ТабличнаяЧасть.Ключ].Удалить(СтрокаТЧ);
			КонецЦикла;
			
			Для Каждого ПодчиненнаяТабличнаяЧастьДляУдаления Из СоответвиеПодчиненныхТЧДляУдаления Цикл
				МассивСтрокДляУдаления = ПодчиненнаяТабличнаяЧастьДляУдаления.Значение;
				Для Каждого СтрокаТЧ Из МассивСтрокДляУдаления Цикл
					Объект[ПодчиненнаяТабличнаяЧастьДляУдаления.Ключ].Удалить(СтрокаТЧ);
				КонецЦикла;
			КонецЦикла;
			
			ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект."+ОбъектМетоданных.Имя));
			ДокументОбъект.Записать(РежимЗаписи);
			
		КонецЦикла;
	
	Исключение
		
		ОтменитьТранзакцию();
		ПараметрыПереносаСтрокТЧ.Вставить("ИнформацияОбОшибке", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;

КонецФункции


Функция ПолучитьАдресВВидеСоответствия(СсылкаНаОбъект, ВидКонтактнойИнформации, Дата = '00010101') Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		МассивОбъектов,
		,
		ВидКонтактнойИнформации,
		Дата);
		
	ЗначениеКонтактнойИнформации = "";
	ПредставлениеКонтактнойИнформации = "";
	
	Если КонтактнаяИнформация.Количество() > 0 Тогда
		// Используется ЗначенияПолей, т.к. он передается в функцию БРО.
		ЗначениеКонтактнойИнформации = КонтактнаяИнформация[0].ЗначенияПолей;
		ПредставлениеКонтактнойИнформации = КонтактнаяИнформация[0].Представление;
		ЗначениеJSON = КонтактнаяИнформация[0].Значение;
	КонецЕсли;
	
	РоссийскийАдрес = ПустойРоссийскийАдрес();
	
	Если СтрНайти(ЗначениеКонтактнойИнформации, "АдресРФ") > 0 Тогда
		РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(ЗначениеКонтактнойИнформации, РоссийскийАдрес);
	Иначе
		СформироватьАдресИзСтрокиВФорматеДевятьЗапятых(ЗначениеJSON, ПредставлениеКонтактнойИнформации, РоссийскийАдрес);
	КонецЕсли;
	
	ЗаполнитьНаселенныйПунктВРоссийскомАдресе(РоссийскийАдрес);
	
	Возврат РоссийскийАдрес;
	
КонецФункции

Функция ПустойРоссийскийАдрес()

	РоссийскийАдрес = Новый Соответствие;
	
	РоссийскийАдрес.Вставить("Индекс",	        );
	РоссийскийАдрес.Вставить("Регион",          );
	РоссийскийАдрес.Вставить("КодРегиона",      );
	РоссийскийАдрес.Вставить("Район",           );
	РоссийскийАдрес.Вставить("Город",           );
	РоссийскийАдрес.Вставить("НаселенныйПункт", );
	РоссийскийАдрес.Вставить("Улица",           );
	РоссийскийАдрес.Вставить("Дом",             );
	РоссийскийАдрес.Вставить("Корпус",          );
	РоссийскийАдрес.Вставить("Квартира",        );
	
	Возврат РоссийскийАдрес;
	
КонецФункции

Процедура ЗаполнитьНаселенныйПунктВРоссийскомАдресе(РоссийскийАдрес)

	Если ТипЗнч(РоссийскийАдрес) = Тип("Соответствие") Тогда
		
		Город           = РоссийскийАдрес.Получить("Город");
		НаселенныйПункт = РоссийскийАдрес.Получить("НаселенныйПункт");
		Регион          = РоссийскийАдрес.Получить("Регион");
		
		Если НЕ ПустаяСтрока(Город) Тогда
			
			НаселенныйПункт = Город + ?(НЕ ПустаяСтрока(НаселенныйПункт), ", " + НаселенныйПункт, "");
			РоссийскийАдрес.Вставить("НаселенныйПункт", НаселенныйПункт);
			
		ИначеЕсли НЕ ПустаяСтрока(Регион) И ПустаяСтрока(НаселенныйПункт) Тогда
			
			РоссийскийАдрес.Вставить("НаселенныйПункт", Регион);
		
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьАдресИзСтрокиВФорматеДевятьЗапятых(ЗначениеКонтактнойИнформации, ПредставлениеКонтактнойИнформации, РоссийскийАдрес)
	
	Для Каждого Элемент Из РоссийскийАдрес Цикл
		РоссийскийАдрес[Элемент.Ключ] = "";
	КонецЦикла;

	Если ПредставлениеКонтактнойИнформации = "" Тогда
		Возврат;
	КонецЕсли;
	
	КоординатыПервойЗапятой = СтрНайти(ПредставлениеКонтактнойИнформации, ",");
	
	Если КоординатыПервойЗапятой > 0 Тогда
		Если СтрЧислоВхождений(ПредставлениеКонтактнойИнформации, ",") = 10 Тогда
			// Для иностранного адреса представление может содержать наименование страны
			ПредставлениеКонтактнойИнформации = СокрЛП(Сред(ПредставлениеКонтактнойИнформации, КоординатыПервойЗапятой + 1));
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ПредставлениеКонтактнойИнформации, ",") <> 9 Тогда 
		
		ПредставлениеКонтактнойИнформации = РаботаСАдресами.СведенияОбАдресе(ЗначениеКонтактнойИнформации);
		
		РоссийскийАдрес.Вставить("Индекс",          ПредставлениеКонтактнойИнформации.Индекс);
		РоссийскийАдрес.Вставить("Регион",          ПредставлениеКонтактнойИнформации.Регион);
		РоссийскийАдрес.Вставить("Район",           ПредставлениеКонтактнойИнформации.Район);
		РоссийскийАдрес.Вставить("Город",           ПредставлениеКонтактнойИнформации.Город);
		РоссийскийАдрес.Вставить("НаселенныйПункт", ПредставлениеКонтактнойИнформации.НаселенныйПункт);
		РоссийскийАдрес.Вставить("Улица",           ПредставлениеКонтактнойИнформации.Улица);
		
		РоссийскийАдрес.Вставить("Дом",
			?(ЗначениеЗаполнено(ПредставлениеКонтактнойИнформации.Здание.Номер), 
			ПредставлениеКонтактнойИнформации.Здание.Номер, ""));
			
		Если ПредставлениеКонтактнойИнформации.Корпуса.Количество() <> 0
			И ЗначениеЗаполнено(ПредставлениеКонтактнойИнформации.Корпуса[0].Номер) Тогда
			РоссийскийАдрес.Вставить("Корпус", ПредставлениеКонтактнойИнформации.Корпуса[0].Номер);
		КонецЕсли;
		
		Если ПредставлениеКонтактнойИнформации.Помещения.Количество() <> 0
			И ЗначениеЗаполнено(ПредставлениеКонтактнойИнформации.Помещения[0].Номер) Тогда
			РоссийскийАдрес.Вставить("Квартира", ПредставлениеКонтактнойИнформации.Помещения[0].Номер);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	РоссийскийАдрес = АдресВФормате9ЗапятыхВСтруктуруПорталаФТС(ПредставлениеКонтактнойИнформации);
	
КонецПроцедуры

Функция АдресВФормате9ЗапятыхВСтруктуруПорталаФТС(АдресВФормате9Запятых)
	 
	КопияАдреса = АдресВФормате9Запятых;
	
	ПоследняяКоордината = 0;
	СоставляющиеАдреса = Новый Массив;
	КоординатыЗапятых = Новый Массив;
	Для Сч = 1 По 12 Цикл
		КоординатаЗапятой = СтрНайти(КопияАдреса, ",");
		Если КоординатаЗапятой > 0 Тогда
			КоординатыЗапятых.Добавить(ПоследняяКоордината + КоординатаЗапятой);
			ПоследняяКоордината = ПоследняяКоордината + КоординатаЗапятой;
			КопияАдреса = Сред(КопияАдреса, КоординатаЗапятой + 1);
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	КоличествоЗапятых = КоординатыЗапятых.Количество();

	СоставляющиеАдреса.Добавить(СокрЛП(Лев(АдресВФормате9Запятых, КоординатыЗапятых[0] - 1)));
	Для Сч = 0 По КоличествоЗапятых - 2 Цикл
		СоставляющиеАдреса.Добавить(СокрЛП(Сред(АдресВФормате9Запятых, КоординатыЗапятых[Сч] + 1, КоординатыЗапятых[Сч + 1] - (КоординатыЗапятых[Сч] + 1))));
	КонецЦикла;
	СоставляющиеАдреса.Добавить(СокрЛП(Сред(АдресВФормате9Запятых, КоординатыЗапятых[КоличествоЗапятых - 1] + 1)));
	
	Регион = "";
	
	Если СокрЛП(СоставляющиеАдреса[2]) <> "" Тогда
		Регион = СокрЛП(СоставляющиеАдреса[2]);
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Регион) Тогда
			Регион = РегламентированнаяОтчетностьВызовСервера.ПолучитьНазваниеРегионаПоКоду(Регион);
		КонецЕсли;
	КонецЕсли;
	
	РоссийскийАдрес = Новый Соответствие;
	
	РоссийскийАдрес.Вставить("Индекс",			СоставляющиеАдреса[1]);
	РоссийскийАдрес.Вставить("Регион",          Регион);
	РоссийскийАдрес.Вставить("КодРегиона",      СоставляющиеАдреса[2]);
	РоссийскийАдрес.Вставить("Район",           СоставляющиеАдреса[3]);
	РоссийскийАдрес.Вставить("Город",           СоставляющиеАдреса[4]);
	РоссийскийАдрес.Вставить("НаселенныйПункт", СоставляющиеАдреса[5]);
	РоссийскийАдрес.Вставить("Улица",           СоставляющиеАдреса[6]);
	РоссийскийАдрес.Вставить("Дом",             СоставляющиеАдреса[7]);
	РоссийскийАдрес.Вставить("Корпус",          СоставляющиеАдреса[8]);
	РоссийскийАдрес.Вставить("Квартира",        СоставляющиеАдреса[9]);
	
	Возврат РоссийскийАдрес;
	
КонецФункции

// Функция возвращает структуру запрашиваемых параметров товара для заполнения вручном режиме
// отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  Показатели - Строка - Разделенные через запятую показатели для заполнения
//                        отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
//
// Возвращаемое значение:
//  - Структура - значенение показателей отчета РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС
Функция ХарактеристикиТовараДляОтчетаСтатистикаФормаУчетаПеремещенияТоваровТС(Номенклатура, Показатели) Экспорт
	
	ПередаваемыеПоказатели = Новый Структура;
	
	Для Каждого Элемент Из СтрРазделить(Показатели, ",", Ложь) Цикл
		ПередаваемыеПоказатели.Вставить(Элемент, "");
	КонецЦикла;
	
	ПередаваемыеПоказатели.Вставить("Графа19Соответствие", Новый Соответствие);
	ПередаваемыеПоказатели.Вставить("СписокНомеровТаможеннойДекларации", Новый СписокЗначений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.НаименованиеПолное КАК Наименование,
	|	Номенклатура.ТоварнаяНоменклатураВЭД КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") = ""166""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """")
	|	КОНЕЦ КАК ЕдИзмТовараКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") = ""166""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, """")
	|	КОНЕЦ КАК ЕдИзмТовараКратко,
	|	Номенклатура.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ВЫБОР
	|		КОГДА Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодЕдИзмеренияТНВЭДПрослеживаемогоТовара,
	|	ВЫБОР
	|		КОГДА Номенклатура.ПрослеживаемыйТовар
	|			ТОГДА ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕдИзмеренияТНВЭДПрослеживаемогоТовара,
	|	Номенклатура.СтранаПроисхождения.Наименование КАК СтранаТовараНаименование,
	|	Номенклатура.СтранаПроисхождения.КодАльфа2 КАК СтранаТовараКод,
	|	"""" КАК НомерТаможеннойДекларации,
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.Производитель.ИНН КАК ПроизводительИНН,
	|	Номенклатура.Производитель.КПП КАК ПроизводительКПП,
	|	Номенклатура.Производитель.РегистрационныйНомер КАК ПроизводительОГРН
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ПО Номенклатура.ТоварнаяНоменклатураВЭД = КлассификаторТНВЭД.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО КлассификаторТНВЭД.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.Параметры.Вставить("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ПередаваемыеПоказатели, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.НомерТаможеннойДекларации) Тогда
			
			СтруктураНомераТаможеннойДекларации = Новый Структура;
			СтруктураНомераТаможеннойДекларации.Вставить("КодТО","");
			СтруктураНомераТаможеннойДекларации.Вставить("НомерДок","");
			СтруктураНомераТаможеннойДекларации.Вставить("ДекларацияНом","");
			СтруктураНомераТаможеннойДекларации.Вставить("ДатаРегистрацииСтр","");
			СтруктураНомераТаможеннойДекларации.Вставить("НомерДекларацииНаТовары","");
			
			УчетНДСФормированиеОтчетности.ЗаполнитьРеквизитыТаможеннойДекларации(
				Новый Структура("НомерТаможеннойДекларации", Выборка.НомерТаможеннойДекларации),
				СтруктураНомераТаможеннойДекларации);
			
			ПередаваемыеПоказатели.СписокНомеровТаможеннойДекларации.Добавить(СтруктураНомераТаможеннойДекларации);
			
		КонецЕсли;
		
		Если Выборка.ПрослеживаемыйТовар Тогда
			
			ДопСведенияПрослеживаемыеТовары = "";
			МакетПоказателей = Отчеты.РегламентированныйОтчетСтатистикаФормаУчетаПеремещенияТоваровТС.ПолучитьМакет("СпискиАналогЛК");
			СписокЗначенийГрафы19 = МакетПоказателей.ПолучитьОбласть("Гр19");
		
			Для Ном = 1 По СписокЗначенийГрафы19.ВысотаТаблицы Цикл
				
				Если СокрЛП(СписокЗначенийГрафы19.Область(Ном,1).Текст) = "08" Тогда
					ДопСведенияПрослеживаемыеТовары = СокрЛП(СписокЗначенийГрафы19.Область(Ном,2).Текст);
				КонецЕсли;
				
			КонецЦикла;
			
			ПередаваемыеПоказатели.Графа19Соответствие.Вставить("08", ДопСведенияПрослеживаемыеТовары);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПередаваемыеПоказатели;
	
КонецФункции


#Область ОперацииНДС0

// Функция возвращает значенение настройки КлассифицироватьНоменклатуруПоОперациям0 регистра НастройкиУчетаНДС
// на определенную дату для организации или 1-й организации из списка организаций
//
// Параметры:
//  ДатаЗапроса - Дата
//  Организация - СправочникСсылка.Организации, Массив, СписокЗначений
//
// Возвращаемое значение:
//  - Булево - значенение настройки КлассифицироватьНоменклатуруПоОперациям0 регистра НастройкиУчетаНДС
Функция КлассифицироватьНоменклатуруПоОперациям0(Знач ДатаЗапроса, Организация = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
		
		ДатаЗапроса = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	// При вызове из документов в качестве Организации передается СправочникСсылка.Организации
	
	МассивОрганизаций = Новый Массив;
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций.Добавить(Организация);
	КонецЕсли;
	
	// При вызове из модуля УчетНДСБП в качестве Организации передаются параметры отчета, 
	// которые могут иметь тип Массив или СписокЗначений
	
	Если ТипЗнч(Организация) = Тип("Массив") ИЛИ ТипЗнч(Организация) = Тип("СписокЗначений") Тогда
		МассивОрганизаций = Организация;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.КлассифицироватьНоменклатуруПоОперациям0 КАК КлассифицироватьНоменклатуруПоОперациям0
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&ДатаЗапроса, Организация В (&МассивОрганизаций)) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.Параметры.Вставить("ДатаЗапроса", НачалоКвартала(ДатаЗапроса));
	Запрос.Параметры.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	РезультаЗапроса = Запрос.Выполнить();
	
	Если РезультаЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультаЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КлассифицироватьНоменклатуруПоОперациям0;
	
КонецФункции

// Функция определет если ли в справочнике "Номенклатура" элементы с заполненный реквизитом "Операции0"
//
// Возвращаемое значение:
//  - Булево - если в справочнике "Номенклатура" есть элементы с заполненный реквизитом "Операции0"
Функция ВНоменклатуреЕстьОперации0() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Операции0 <> ЗНАЧЕНИЕ(Справочник.Операции0.ПустаяСсылка)
	|	И НЕ Номенклатура.Операции0 ЕСТЬ NULL
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

Функция ПолучитьВыгружаемыеДанныеЖурналаУчетаСчетовФактур(Ссылка, УникальныйИдентификаторЖурнала) Экспорт

	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	ВыгружаемыеДанные = ДокументОбъект.ВыгрузитьДокумент(УникальныйИдентификаторЖурнала);
	
	Возврат ВыгружаемыеДанные;

КонецФункции

Функция СтавкаНДСПользователя() Экспорт
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация.УдалитьСтавкаНДСПоУмолчанию, "ПеречислениеСтавкаНДС");
КонецФункции

Функция СтавкаНДС(ВидСтавки, Период) Экспорт
	
	Возврат Справочники.СтавкиНДС.СтавкаНДС(ВидСтавки, Период);
	
КонецФункции

Функция РасчетнаяСтавкаНДСПоОбычной(СтавкаНДС) Экспорт
	
	Возврат Перечисления.СтавкиНДС.РасчетнаяСтавкаНДСПоОбычной(СтавкаНДС);
	
КонецФункции

Функция РасчетнаяСтавкаНДСОрганизации(Организация, Дата) Экспорт
	
	СтавкаНалогообложенияПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(Организация, Дата);
	Если ЗначениеЗаполнено(СтавкаНалогообложенияПриУСН) Тогда
		Возврат Перечисления.СтавкиНДС.РасчетнаяСтавкаНДСПоОбычной(
			Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНалогообложенияПриУСН, Дата));
	КонецЕсли;
	
	Возврат Перечисления.СтавкиНДС.РасчетнаяСтавкаНДСПоОбычной(
		Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Дата));
	
КонецФункции

Функция СтавкаНДСПоОрганизации(Организация, Дата) Экспорт
	
	СтавкаНалогообложенияПриУСН = РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(Организация, Дата);
	Если ЗначениеЗаполнено(СтавкаНалогообложенияПриУСН) Тогда
		Возврат Перечисления.СтавкиНДС.СтавкаНДС(СтавкаНалогообложенияПриУСН, Дата);
	ИначеЕсли УчетнаяПолитика.ПлательщикНДС(Организация, Дата)
		Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Перечисления.СтавкиНДС.СтавкаНДС(Перечисления.ВидыСтавокНДС.Общая, Дата);
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	КонецЕсли;
	
КонецФункции

// Функция возвращает значенение по умолчанию кода операции НДС 0% из регистра НастройкиУчетаНДС
// на определенную дату для организации или 1-й организации из списка организаций
//
// Параметры:
//  ДатаЗапроса - Дата
//  Организация - СправочникСсылка.Организации, Массив, СписокЗначений
//
// Возвращаемое значение:
//  - Строка - код операции НДС 0% по умолчанию
Функция КодОперацииПоСтавке0ПоУмолчанию(Знач ДатаЗапроса, Организация = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаЗапроса) Тогда
		
		ДатаЗапроса = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	// При вызове из документов в качестве Организации передается СправочникСсылка.Организации
	
	МассивОрганизаций = Новый Массив;
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		МассивОрганизаций.Добавить(Организация);
	КонецЕсли;
	
	// При вызове из модулей УчетНДСФормированиеОтчетности и Отчет.РасшифровкаПоказателейНДС.Модуль менеджера
	// в качестве Организации передаются параметры отчета, которые могут иметь тип Массив или СписокЗначений
	
	Если ТипЗнч(Организация) = Тип("Массив") ИЛИ ТипЗнч(Организация) = Тип("СписокЗначений") Тогда
		МассивОрганизаций = Организация;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.КодОперации0 КАК КодОперации0
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&ДатаЗапроса, Организация В (&МассивОрганизаций)) КАК НастройкиУчетаНДССрезПоследних";
	
	Запрос.Параметры.Вставить("ДатаЗапроса", ДатаЗапроса);
	Запрос.Параметры.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	РезультаЗапроса = Запрос.Выполнить();
	
	Если РезультаЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультаЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КодОперации0;
	
КонецФункции

// Функция по реквизитам документа основания определяет ссылку на существующий
// отчет "Cтатестическая форма учета перемещения товаров".
// 
// Параметры:
// Реквизиты                     - Структура - содержит реквизиты документа, на основании которого
//                                 открывается статестическая форма учета перемещения товаров.
//  поля структуры:
//    Ссылка                     - ДокументСсылка документа на основании, которого ищем отчет
//                                 "Cтатестическая форма учета перемещения товаров".
//    Дата                       - Дата - дата документа основания.
//    Организация                - СправочникСсылка.Организации - организация документа основания.
//
// Возвращаемое значение:
// - ДокументСсылка - СсылкаНаСуществующуюСтатформу - Документ.РегламентированныйОтчет или Неопределено.
Функция ОпределитьСсылкуНаСуществующуюСтатформу(Реквизиты) Экспорт
	Возврат ФормаУчетаПеремещенияТоваровТС.ОпределитьСсылкуНаСуществующуюСтатформу(Реквизиты);
КонецФункции

//Функция возвращает реквизиты документа основания статформы
//
// Параметры:
//  Основание - ДокументСсылка.ЗаявлениеОВвозеТоваров, ДокументСсылка.РеализацияТоваровУслуг
//
// Возвращаемое значение:
//  - Структура
//		- ПометкаУдаления - Булево
//		- Дата            - Дата - дата документа основания.
//		- Организация     - СправочникСсылка.Организации - организация документа основания.
Функция РеквизитыДокументаОснованияСтатформы(Основание) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание,
							"ПометкаУдаления, Ссылка, Дата, Организация");
КонецФункции

#КонецОбласти

#КонецОбласти
